<?php


function Insertion($requete) {
	 
	$data = array (
    0=>"",
    1=>"",
    2=>array(
    			0=>array('docs' => "", 'hits' => "")
			),
	3=>array(
				0=> array(
					'ayaId'=>"",
					'souraId'=>"",
					'texte'=>""
						)
			),	
	4=>array(0=>"")
	);	
	
	
	$data = '{"1":1,"2":5,"0":{"0":"البقرة"},"3":{"0":"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ الم"},"4":{"0":"ذَٰلِكَ الْكِتَابُ لَا رَيْبَ ۛ فِيهِ ۛ هُدًى لِلْمُتَّقِينَ"},"5":{"0":"الَّذِينَ يُؤْمِنُونَ بِالْغَيْبِ وَيُقِيمُونَ الصَّلَاةَ وَمِمَّا رَزَقْنَاهُمْ يُنْفِقُونَ"},"6":{"0":"وَالَّذِينَ يُؤْمِنُونَ بِمَا أُنْزِلَ إِلَيْكَ وَمَا أُنْزِلَ مِنْ قَبْلِكَ وَبِالْآخِرَةِ هُمْ يُوقِنُونَ"},"7":{"0":"أُولَٰئِكَ عَلَىٰ هُدًى مِنْ رَبِّهِمْ ۖ وَأُولَٰئِكَ هُمُ الْمُفْلِحُونَ"}}';
	return $data;
}

function Recherche($requete) {
	 
	$data = array (
    0=>"",
    1=>"",
    2=>array(
    			0=>array('docs' => "", 'hits' => "")
			),
	3=>array(
				0=> array(
					'ayaId'=>"",
					'souraId'=>"",
					'texte'=>""
						)
			),	
	4=>array(0=>"")
	);	
	
	
	$data[0]="1";
	$data[1]="1";
	
	$data[2][0]['docs']="2";
	$data[2][0]['hits']="2";
	
	$data[3][0]['ayaId']="144";
	$data[3][0]['souraId']="3";
	$data[3][0]['texte']="وَمَا <b>مُحَمَّدٌ</b> إِلَّا رَسُولٌ قَدْ خَلَتْ مِنْ قَبْلِهِ الرُّسُلُ ? أَفَإِنْ مَاتَ أَوْ قُتِلَ انْقَلَبْتُمْ عَلَى? أَعْقَابِكُمْ ? وَمَنْ يَنْقَلِبْ عَلَى? عَقِبَيْهِ فَلَنْ يَضُرَّ اللَّهَ شَيْئًا ? وَسَيَجْزِي اللَّهُ الشَّاكِرِينَ";
	$data[3][1]['ayaId']="33";
	$data[3][1]['souraId']="40";
	$data[3][1]['texte']="مَا كَانَ <b>مُحَمَّدٌ</b> أَبَا أَحَدٍ مِنْ رِجَالِكُمْ وَلَ?كِنْ رَسُولَ اللَّهِ وَخَاتَمَ النَّبِيِّينَ ? وَكَانَ اللَّهُ بِكُلِّ شَيْءٍ عَلِيمًا";
	
	$data[4][0]="بحمدك";
	$data[4][1]="الحمد";
	$data[4][2]="محمد";
	
	$result = json_encode( $data,JSON_UNESCAPED_UNICODE);
	return $result;
}

?>